{
	"Navigation": {
		"home": "Home",
		"about": "About me"
	},
	"HeroSection": {
		"title": "Hi, I'm Szymon",
		"subtitle": "I'm a Front-End Developer",
		"description": "I have spent the last 2 years learning and coding amazing websites and software. Occasionally I also edit videos (in case you have a super idea or visions). Let's get in touch!",
		"contactButton": "Contact me"
	},
	"About": {
		"title": "About me",
		"description": "Hi, I'm Szymon. As a Front-End developer, I turn projects into modern and efficient websites. This site is a showcase of my capabilities - I demonstrate what a well-done project should look like on the web. I have over a year of commercial experience, but I've been coding much longer than that. What sets me apart? Realism and partnership approach. I know what kind of product I can deliver and always focus on quality and transparent communication. Do you need a solid website for your business? I invite you to contact me.",
		"button": "About me"
	},
	"WorkExperience": {
		"title": "Work Experience",

		"FCBworkStart": "April 2024",
		"FCBworkEnd": "May 2025",

		"BraughmanworkStart": "June 2024",
		"BraughmanworkEnd": "August 2024",

		"FreelancingworkStart": "June 2024",
		"FreelancingworkEnd": "Now"
	},
	"Skills": {
		"title": "Skills"
	},
	"Projects": {
		"title": "My Projects",
		"NoteAppDescription": "Mobile application for creating and managing notes",
		"NoteAppFeature1": "Adding notes through a form",
		"NoteAppFeature2": "Filtering active notes",
		"NoteAppFeature3": "Editing each individual note",

		"TrzyCzteRyDescription": "Website presenting the offer of a company renting inflatables",
		"TrzyCzteRyFeature1": "Filtering individual attractions",
		"TrzyCzteRyFeature2": "Inflatable offers",
		"TrzyCzteRyFeature3": "Responsive Design",

		"SparkAmberDescription": "Site created to familiarize yourself with Framer Motion and payments method with Stripe",
		"SparkAmberFeature1": "Framer Motion animation",
		"SparkAmberFeature2": "Clean and tidy styles",
		"SparkAmberFeature3": "Working Paypments using Stripe",

		"PortfolioDescription": "My portfolio created to showcase my skills and experience",
		"PortfolioFeature1": "Modern, responsive design",
		"PortfolioFeature2": "Animations using Framer Motion",
		"PortfolioFeature3": "Multilingual (i18n)",

		"close": "Close",
		"live": "Live"
	},
	"Footer": {
		"title": "Let's work",
		"subtitle": "together",
		"buttonContact": "Get in touch"
	},

	"AboutSubPage": {
		"title": "About me",
		"intro": "Hi, I'm Szymon -> a front-end developer with a passion for code, aesthetics, and... physical fitness.",
		"daily": "Every day, I design and build modern websites – ones that not only look good but also run fast, intuitively, and without compromise. I love combining logic with creativity – it's that mix that got me hooked on web development.",
		"lifestyle": "But my life isn’t just digital. I’m currently in my final year of high school, preparing for my graduation exams before heading to university to study what I truly want to do in the future. I’ve been a volunteer firefighter for years – a role that taught me responsibility, pressure management, and teamwork. On top of that, I train regularly – the gym is like a second home to me, and I go there up to 5 times a week. I care about my body because physical fitness isn’t just about looks – it’s about energy, discipline, and health, all of which influence how I work.",
		"hobbies": "After hours, I enjoy editing videos – sometimes for myself, sometimes for friends. It’s my creative break from code and a great exercise in attention to detail.",
		"approach": "In work, I focus on quality, a realistic approach, and a true partnership. I don’t make empty promises – instead, I deliver solid solutions, clear communication, and full engagement from start to finish.",
		"closing": "If you're looking for someone who not only knows front-end but also has clear priorities and knows how to get things done – feel free to reach out."
	},

	"services": {
		"design": {
			"title": "Design",
			"description": "I design intuitive and visually appealing interfaces that attract attention and are enjoyable to use. I focus on consistency and usability."
		},
		"development": {
			"title": "Development",
			"description": "I turn designs into modern websites – fast, responsive, and optimized for all devices."
		},
		"package": {
			"title": "The full package",
			"description": "From the first idea to the final launch – I provide full support at every stage of building a website or application."
		}
	},

	"404Page": {
		"title": "Page not found",
		"subtitle": "I see you got lost. Let me help you get back to the home page",
		"btnText": "Back to home page"
	}
}
