{
	"Navigation": {
		"home": "Home",
		"about": "O mnie"
	},
	"HeroSection": {
		"title": "Cześć, jestem Szymon",
		"subtitle": "Jestem Front-End Developerem",
		"description": "Ostatnie 2 lata poświęciłem na naukę i kodowanie niesamowitych stron internetowych oraz oprogramowania. Zajawkowo również montuje filmy (na wypadek, gdybyś miał/a super pomysł bądź wizje). Skontaktujmy się!",
		"contactButton": "Skontaktuj się"
	},
	"About": {
		"title": "O mnie",
		"description": "Cześć, jestem Szymon. Jako programista Front-End zamieniam projekty w nowoczesne i wydajne strony internetowe. Ta strona jest wizytówką moich możliwości – pokazuję, jak powinien wyglądać dobrze zrobiony projekt w sieci. Mam ponad rok doświadczenia komercyjnego, ale koduję znacznie dłużej. Co mnie wyróżnia? Realizm i partnerskie podejście. Wiem, jaki produkt mogę dostarczyć i zawsze stawiam na jakość oraz transparentną komunikację. Potrzebujesz solidnej strony dla swojego biznesu? Zapraszam do kontaktu.",
		"button": "O mnie"
	},
	"WorkExperience": {
		"title": "Doświadczenie zawodowe",

		"FCBworkStart": "Kwiecień 2024",
		"FCBworkEnd": "Maj 2025",

		"BraughmanworkStart": "Czerwiec 2024",
		"BraughmanworkEnd": "Sierpień 2024",

		"FreelancingworkStart": "Czerwiec 2024",
		"FreelancingworkEnd": "Obecnie"
	},
	"Skills": {
		"title": "Umiejętności"
	},
	"Projects": {
		"title": "Moje Projekty",
		"NoteAppDescription": "Aplikacja mobilna do tworzenia notatek oraz zarządzania nimi",
		"NoteAppFeature1": "Dodawanie notatek przez formularz",
		"NoteAppFeature2": "Filtrowanie aktywnych notatek",
		"NoteAppFeature3": "Edytowanie każdej poszczególnej notatki",

		"TrzyCzteRyDescription": "Strona internetowa prezentująca ofertę firmy wynajmującej dmuchańce",
		"TrzyCzteRyFeature1": "Filtrowanie poszczególnych atrakcji ",
		"TrzyCzteRyFeature2": "Oferty Dmuchańców",
		"TrzyCzteRyFeature3": "Responsywny Design",

		"SparkAmberDescription": "Strona stworzona aby zaznajomić się z biblioteką Framer Motion oraz płatnościami serwisu Stripe",
		"SparkAmberFeature1": "Animacje z użyciem Framer Motion",
		"SparkAmberFeature2": "Czysty i schludny styl",
		"SparkAmberFeature3": "Działająca bramka płatności Stripe",

		"PortfolioDescription": "Moje portfolio stworzone w celu zaprezentowania umiejętności oraz doświadczenia, które posiadam.",
		"PortfolioFeature1": "Nowoczesny, responsywny design",
		"PortfolioFeature2": "Animacje z użyciem Framer Motion",
		"PortfolioFeature3": "Wielojęzyczność (i18n)",

		"close": "Zamknij",
		"live": "Zobacz"
	},
	"Footer": {
		"title": "Pracujmy razem",
		"subtitle": "",
		"buttonContact": "Skontaktuj się"
	},

	"AboutSubPage": {
		"title": "O mnie",
		"intro": "Cześć, jestem Szymon -> front-endowiec z pasją do kodu, estetyki i... sprawności fizycznej.",
		"daily": "Na co dzień projektuję i wdrażam nowoczesne strony internetowe – takie, które nie tylko dobrze wyglądają, ale też działają szybko, intuicyjnie i bez kompromisów. Uwielbiam łączyć logikę z kreatywnością – to właśnie ta mieszanka sprawia, że web development wciągnął mnie na dobre.",
		"lifestyle": "Ale moje życie to nie tylko świat cyfrowy. Aktualnie jestem uczniem 5 klasy maturalnej i przygotowuje się do zdania matur, żeby potem pójść na studia związane z tym co chcę robić w przyszłości. Od 5 lat jestem strażakiem ochotnikiem – to rola, która wiele mnie nauczyła: odpowiedzialności, działania pod presją, pracy zespołowej. Do tego regularnie trenuję – siłownia to mój drugi dom, bywam tam nawet 5 razy w tygodniu. Dbam o ciało, bo wiem, że forma fizyczna to nie tylko wygląd, ale też energia, dyscyplina i zdrowie – rzeczy, które mocno przekładają się na moje podejście do pracy.",
		"hobbies": "Po godzinach lubię też montować filmy – czasem dla siebie, czasem dla znajomych. To moja kreatywna odskocznia od kodu i dobre ćwiczenie dla oka do detalu.",
		"approach": "W pracy stawiam na jakość, realistyczne podejście i partnerską współpracę. Nie obiecuję gruszek na wierzbie – zamiast tego proponuję solidne rozwiązania, jasną komunikację i zaangażowanie od początku do końca.",
		"closing": "Jeśli szukasz kogoś, kto nie tylko ogarnia front-end, ale też ma poukładane priorytety i wie, co znaczy „dowieźć temat” – napisz śmiało."
	},

	"services": {
		"design": {
			"title": "Projekt graficzny",
			"description": "Projektuję intuicyjne i estetyczne interfejsy, które przyciągają uwagę i są przyjemne w użytkowaniu. Stawiam na spójność wizualną i funkcjonalność."
		},
		"development": {
			"title": "Rozwój projektu",
			"description": "Zamieniam projekty w nowoczesne strony internetowe – szybkie, responsywne i zoptymalizowane pod każde urządzenie."
		},
		"package": {
			"title": "Kompleksowa realizacja",
			"description": "Od pierwszego pomysłu po finalne wdrożenie – zapewniam pełne wsparcie na każdym etapie tworzenia strony internetowej lub aplikacji."
		}
	},

	"404Page": {
		"title": "Strona nie znaleziona",
		"subtitle": "Widzę, że się zgubiłeś. Chodź pomogę ci wrócić na stronę główną",
		"btnText": "Wróć na stronę główną"
	}
}
